Revit 2027 API
FabricSheetType.MinorLapSpliceLength Property
 The lap splice length in the minor direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinorLapSpliceLength { get; set; }
Public Property MinorLapSpliceLength As Double
	Get
	Set
public:
property double MinorLapSpliceLength {
	double get ();
	void set (double value);
}
member MinorLapSpliceLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: minorLapSpliceLength is greater than the half of the overall width.
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace